import type Wlc双列互换数据 from '@wulechuan/vue2-ui--two-columns-exchange-items/源代码/发布的源代码/typescript/wlc-双列互换数据.vue'

export interface 范_双列互换数据_实际条目 extends Wlc双列互换数据.范_基础条目 {
    数据: string;
}

export type 范_双列互换数据_实际条目之列表 = Array<范_双列互换数据_实际条目>

export const 一切可能的条目之列表: Array<范_双列互换数据_实际条目> = [
    {
        唯一标识: '蠃鱼',
        数据: '蠃鱼',
        在界面中的称谓: '蠃（luǒ）鱼',
    },
    {
        唯一标识: '蠃鱼',
        数据: '蠃鱼',
        在界面中的称谓: '蠃（luǒ）鱼（系故意重复之条目）',
    },
    {
        唯一标识: '三足乌',
        数据: '三足乌',
        在界面中的称谓: '三足乌',
    },
    {
        唯一标识: '鲲鹏',
        数据: '鲲鹏',
        在界面中的称谓: '鲲鹏',
    },
    {
        唯一标识: '穷奇',
        数据: '穷奇',
        在界面中的称谓: '穷奇',
    },
    {
        唯一标识: '饕餮',
        数据: '饕餮',
        在界面中的称谓: '饕（tāo）餮（tiè）',
    },
    {
        唯一标识: '蜚',
        数据: '蜚',
        在界面中的称谓: '蜚（fēi）',
    },
    {
        唯一标识: '天狗',
        数据: '天狗',
        在界面中的称谓: '天狗',
    },
    {
        唯一标识: '狰',
        数据: '狰',
        在界面中的称谓: '狰',
    },
    {
        唯一标识: '蠃鱼',
        数据: '蠃鱼',
        在界面中的称谓: '蠃（luǒ）鱼（系故意重复之条目）',
    },
    {
        唯一标识: '肥遗',
        数据: '肥遗',
        在界面中的称谓: '肥遗',
        已禁止选择: true,
    },
    {
        唯一标识: '蛊雕',
        数据: '蛊雕',
        在界面中的称谓: '蛊（gǔ）雕',
    },
    {
        唯一标识: '九尾狐',
        数据: '九尾狐',
        在界面中的称谓: '九尾狐',
    },
    {
        唯一标识: '九婴',
        数据: '九婴',
        在界面中的称谓: '九婴',
        已禁止选择: true,
    },
    {
        唯一标识: '旋龟',
        数据: '旋龟',
        在界面中的称谓: '旋龟',
    },
    {
        唯一标识: '夫诸',
        数据: '夫诸',
        在界面中的称谓: '夫诸',
        已禁止选择: true,
    },
    {
        唯一标识: '青龙',
        数据: '青龙',
        在界面中的称谓: '青龙',
    },
    {
        唯一标识: '白虎',
        数据: '白虎',
        在界面中的称谓: '白虎',
    },
    {
        唯一标识: '朱雀',
        数据: '朱雀',
        在界面中的称谓: '朱雀',
    },
    {
        唯一标识: '玄武',
        数据: '玄武',
        在界面中的称谓: '玄武',
    },
    {
        唯一标识: '毕方',
        数据: '毕方',
        在界面中的称谓: '毕方',
    },
    {
        唯一标识: '比翼鸟',
        数据: '比翼鸟',
        在界面中的称谓: '比翼鸟',
    },
    {
        唯一标识: '梼杌',
        数据: '梼杌',
        在界面中的称谓: '梼（táo）杌（wù）',
    },
    {
        唯一标识: '白泽',
        数据: '白泽',
        在界面中的称谓: '白泽',
    },
    {
        唯一标识: '獬豸',
        数据: '獬豸',
        在界面中的称谓: '獬（xiè）豸（zhì）',
    },
    {
        唯一标识: '狴犴',
        数据: '狴犴',
        在界面中的称谓: '狴（bì）犴（àn）',
    },
    {
        唯一标识: '冉遗',
        数据: '冉遗',
        在界面中的称谓: '冉（rǎn）遗',
    },
    {
        唯一标识: '夔牛',
        数据: '夔牛',
        在界面中的称谓: '夔（kuí）牛',
    },
    {
        唯一标识: '山膏',
        数据: '山膏',
        在界面中的称谓: '山膏（huān）',
    },
    // {
    //     唯一标识: '九尾狐',
    //     数据: '九尾狐',
    //     在界面中的称谓: '九尾狐（系故意重复之条目）',
    // },
    {
        唯一标识: '騊駼',
        数据: '騊駼',
        在界面中的称谓: '騊（táo）駼（tú）',
    },
    {
        唯一标识: '狍鸮',
        数据: '狍鸮',
        在界面中的称谓: '狍（páo）鸮（xiāo）',
    },
    {
        唯一标识: '陆吾',
        数据: '陆吾',
        在界面中的称谓: '陆吾',
    },
    {
        唯一标识: '蛩蛩',
        数据: '蛩蛩',
        在界面中的称谓: '蛩（qiónɡ）蛩（qiónɡ）',
    },
    {
        唯一标识: '乘黄',
        数据: '乘黄',
        在界面中的称谓: '乘（shèng）黄',
    },
    {
        唯一标识: '重明鸟',
        数据: '重明鸟',
        在界面中的称谓: '重明鸟',
    },
    {
        唯一标识: '凤凰',
        数据: '凤凰',
        在界面中的称谓: '凤凰',
    },
    {
        唯一标识: '混沌',
        数据: '混沌',
        在界面中的称谓: '混沌',
    },
    {
        唯一标识: '麒麟',
        数据: '麒麟',
        在界面中的称谓: '麒麟',
    },
    {
        唯一标识: '猰貐',
        数据: '猰貐',
        在界面中的称谓: '猰（yà）貐（yǔ）',
    },
    {
        唯一标识: '横公鱼',
        数据: '横公鱼',
        在界面中的称谓: '横公鱼',
    },
    {
        唯一标识: '英招',
        数据: '英招',
        在界面中的称谓: '英招',
    },
    {
        唯一标识: '巴蛇',
        数据: '巴蛇',
        在界面中的称谓: '巴蛇',
    },
    {
        唯一标识: '应龙',
        数据: '应龙',
        在界面中的称谓: '应（yīng）龙',
    },
    {
        唯一标识: '烛龙',
        数据: '烛龙',
        在界面中的称谓: '烛龙',
    },
    {
        唯一标识: '辟邪',
        数据: '辟邪',
        在界面中的称谓: '辟邪',
    },
    {
        唯一标识: '天马',
        数据: '天马',
        在界面中的称谓: '天马',
    },
    {
        唯一标识: '鱼妇',
        数据: '鱼妇',
        在界面中的称谓: '鱼妇',
    },
    {
        唯一标识: '当扈',
        数据: '当扈',
        在界面中的称谓: '当（dāng）扈（hù）',
    },
    {
        唯一标识: '青鸟',
        数据: '青鸟',
        在界面中的称谓: '青鸟',
    },
    {
        唯一标识: '化蛇',
        数据: '化蛇',
        在界面中的称谓: '化蛇',
    },
    {
        唯一标识: '朱厌',
        数据: '朱厌',
        在界面中的称谓: '朱厌',
    },
    {
        唯一标识: '角端',
        数据: '角端',
        在界面中的称谓: '角端',
    },
    {
        唯一标识: '当康',
        数据: '当康',
        在界面中的称谓: '当康',
    },
    {
        唯一标识: '赤鱬',
        数据: '赤鱬',
        在界面中的称谓: '赤鱬（rú）',
    },
    {
        唯一标识: '兕',
        数据: '兕',
        在界面中的称谓: '兕（sì）',
    },
]
