import type Wlc双列互换数据 from '@wulechuan/vue2-ui--two-columns-exchange-items/源代码/发布的源代码/typescript/wlc-双列互换数据.vue'

export interface 范_双列互换数据_实际条目 extends Wlc双列互换数据.范_基础条目 {
    数据?: {
        描述?: string | string[];
    };
}

export type 范_双列互换数据_实际条目之列表 = Array<范_双列互换数据_实际条目>

export const 一切可能的条目之列表: Array<范_双列互换数据_实际条目> = [
    {
        唯一标识: '蠃鱼',
        在界面中的称谓: '蠃（luǒ）鱼',
        数据: {
            描述: [
                '邽山，蒙水出焉，南流注于洋水，其中多黄贝；蠃鱼，鱼身而鸟翼，音如鸳鸯，见则其邑大水。',
                '一种长着鱼身，却有鸟翅膀的异兽，能发出像鸳鸯一样的鸟叫。它在哪里出现就会在哪里带来水灾。',
            ],
        },
    },

    {
        唯一标识: '蠃鱼',
        在界面中的称谓: '蠃（luǒ）鱼（系故意重复之条目）',
        数据: {
            描述: [
                '邽山，蒙水出焉，南流注于洋水，其中多黄贝；蠃鱼，鱼身而鸟翼，音如鸳鸯，见则其邑大水。',
                '一种长着鱼身，却有鸟翅膀的异兽，能发出像鸳鸯一样的鸟叫。它在哪里出现就会在哪里带来水灾。',
            ],
        },
    },

    {
        唯一标识: '三足乌',
        在界面中的称谓: '三足乌',
        数据: {
            描述: [
                '居于日中，有三足。又称三足金乌。亦称“踆乌”。',
                '其形象是一只黑乌鸦蹲居在金光闪烁的红日中央因而常称为金乌，主要是侍奉西王母，是汉族神话中太阳之灵。神话中说，太阳里有三足乌鸦，古代人们就把金乌作为太阳的别名。',
            ],
        },
    },

    {
        唯一标识: '鲲鹏',
        在界面中的称谓: '鲲（kūn）鹏（péng）',
        数据: {
            描述: [
                '鲲鹏之名，最早出现于《庄子·逍遥游》，其中有鲲化为鹏的说法。',
                '“北冥有鱼，其名为鲲。鲲之大，不知其几千里也。化而为鸟，其名为鹏。鹏之背，不知其几千里也；怒而飞，其翼若垂天之云。是鸟也，海运则将徙于南冥。南冥者，天池也。”',
            ],
        },
    },

    {
        唯一标识: '称谓超长的条目',
        在界面中的称谓: '这是一个称谓超长的条目，其称谓如你所见奇长无比，好似一条神龙盘旋在云霄中',
        数据: { 描述: '一个用于测试排版功能之条目。' },
    },

    {
        唯一标识: '穷奇',
        在界面中的称谓: '穷奇',
        数据: {
            描述: [
                '《山海经·海内北经》记载：穷奇外貌像老虎，大小如同牛般，长有一双翅膀。传说穷奇性情凶狠，喜欢吃人。不忠不信，不听好人之言，专门听信别人的坏话。是西方天帝少昊的后代，因毁信恶忠，崇饰恶言，被舜流放，迁于四裔，以御魑魅。',
                '和混沌、梼杌、饕餮并称为远古“四大凶兽” 。',
            ],
        },
    },

    {
        唯一标识: '饕餮',
        在界面中的称谓: '饕（tāo）餮（tiè）',
        数据: {
            描述: [
                '别名老饕（tāo）、狍（páo）鸮（xiāo），是中国古代神话传说中的一种凶恶贪食的野兽，四大凶兽之一。',
                '据《山海经·北次二经》记载：饕餮其形状如羊身人面，其目在腋下，虎齿人爪，其音如婴儿。是贪欲的象征，常用来形容贪食或贪婪的人。',
            ],
        },
    },

    {
        唯一标识: '蜚',
        在界面中的称谓: '蜚（fēi）',
        数据: {
            描述: [
                '《山海经·卷四·东山经·东次四经》记载：“又东二百里，曰太山，上多金玉、桢木。有兽焉，其状如牛而白首，一目而蛇尾，其名曰蜚。行水则竭，行草则死，见则天下大疫。” ',
                '晋代郭璞《山海经图赞》：“蜚之为名，体似无害，所绎枯竭，其干谯厉。” 当“蜚”进入水中时，水源会立即干涸；当它进入草丛时，草会立即枯死。',
            ],
        },
    },

    {
        唯一标识: '天狗',
        在界面中的称谓: '天狗',
        数据: {
            描述: [
                '中国古代民间传说中的一种动物。',
                '最早记载于《山海经》中，原文是：“又西三百里，曰阴山。浊浴之水出焉，而南流于番泽。其中多文贝，有兽焉，曰天狗，其状如狸而白首，其音如榴榴，可以御凶。”',
                '如文中所述，天狗是种像野猫而头部白色的动物，并是御凶的吉兽，很可能是某种古代哺乳类动物，是真实存在过的。但后来演变成用来形容彗星和流星，古人将天空奔星视为大不吉，所以天狗也变成了凶星的称谓。',
                '《史记·天官》载：“天狗状如大奔星，有声，其下止地类狗，所堕及炎火，望之如火光，炎炎冲天。”',
            ],
        },
    },

    {
        唯一标识: '狰',
        在界面中的称谓: '狰',
        数据: {
            描述: [
                '《山海经·西山一经》又西二百八十里，曰章莪之山，无草木，多瑶碧。所为甚怪。有兽焉，其状如赤豹，五尾一角，其音如击石，其名如“狰”。',
            ],
        },
    },

    {
        唯一标识: '蠃鱼',
        在界面中的称谓: '蠃（luǒ）鱼（系故意重复之条目）',
        数据: {
            描述: [
                '邽山，蒙水出焉，南流注于洋水，其中多黄贝；蠃鱼，鱼身而鸟翼，音如鸳鸯，见则其邑大水。',
                '一种长着鱼身，却有鸟翅膀的异兽，能发出像鸳鸯一样的鸟叫。它在哪里出现就会在哪里带来水灾。',
            ],
        },
    },

    {
        唯一标识: '肥遗',
        在界面中的称谓: '肥遗',
        数据: {
            描述: [
                '据《山海经》记载，共有三种，两蛇一鸟。',
                '《山海经·西山经》：“又西六十里，曰太华之山，削成而四方，其高五千仞，其广十里，鸟兽莫居。有蛇焉，名曰肥甥（wèi），六足四翼，见则天下大旱。”',
                '《山海经·北山经》：“又北百八十里，曰浑夕之山，无草木，多铜玉。嚣水出焉，而西北流注于海。有蛇一首两身，名曰肥遗，见则其国大旱。”',
                '《山海经·西山经》：“又西七十里，曰英山，其上多杻橿，其阴多铁，其阳多赤金。禺水出焉，北流注于招水，其中多䰷鱼，其状如鳖，其音如羊。其阳多箭䉋，兽多㸲牛、羬羊。有鸟焉，其状如鹑，黄身而赤喙，其名曰肥遗，食之已疠，可以杀虫。”',
            ],
        },
        已禁止选择: true,
    },

    {
        唯一标识: '蛊雕',
        在界面中的称谓: '蛊（gǔ）雕',
        数据: {
            描述: [
                '蛊雕是一种似鸟非鸟的食人怪兽。',
                '据《山海经·南山经》记载：“又东五百里，曰鹿吴之山，上无草木，多金石。泽更之水出焉，而南流注于滂水，水有兽焉，名曰蛊雕，其状如雕而有角，其音如婴儿之音，是食人。”',
            ],
        },
    },

    {
        唯一标识: '九尾狐',
        在界面中的称谓: '九尾狐',
        数据: {
            描述: [
                '据《山海经》记载：九尾狐住在青丘国，有四只脚和九只尾巴，声音像婴儿，能吃人。',
            ],
        },
    },

    {
        唯一标识: '九婴',
        在界面中的称谓: '九婴',
        数据: {
            描述: [
                '九婴是古代中国神话传说中的凶兽之一。',
                '出自《淮南子·本经训》。它是水火之怪，能喷水吐火，它的叫声如婴儿啼哭，有九头，故称九婴。尧时出，作害人间，被羿射杀于北狄凶水之中。',
            ],
        },
        已禁止选择: true,
    },

    {
        唯一标识: '旋龟',
        在界面中的称谓: '旋龟',
        数据: {
            描述: [
                '黑而赤的龟。',
                '《山海经》：怪水出焉，而东流注于宪翼之水。其中多玄龟，其状如龟而鸟首虺（huǐ ）尾，其名曰旋龟，其音如判木，佩之不聋，可以为底。',
            ],
        },
    },

    {
        唯一标识: '夫诸',
        在界面中的称谓: '夫诸',
        数据: {
            描述: [
                '',
            ],
        },
        已禁止选择: true,
    },

    {
        唯一标识: '青龙',
        在界面中的称谓: '青龙',
        数据: {
            描述: [
                '',
            ],
        },
    },

    {
        唯一标识: '白虎',
        在界面中的称谓: '白虎',
        数据: {
            描述: [
                '',
            ],
        },
    },

    {
        唯一标识: '朱雀',
        在界面中的称谓: '朱雀',
        数据: {
            描述: [
                '',
            ],
        },
    },

    {
        唯一标识: '玄武',
        在界面中的称谓: '玄武',
        数据: {
            描述: [
                '',
            ],
        },
    },

    {
        唯一标识: '毕方',
        在界面中的称谓: '毕方',
        数据: {
            描述: [
                '',
            ],
        },
    },

    {
        唯一标识: '比翼鸟',
        在界面中的称谓: '比翼鸟',
        数据: {
            描述: [
                '',
            ],
        },
    },

    {
        唯一标识: '梼杌',
        在界面中的称谓: '梼（táo）杌（wù）',
        数据: {
            描述: [
                '',
            ],
        },
    },

    {
        唯一标识: '白泽',
        在界面中的称谓: '白泽',
        数据: {
            描述: [
                '',
            ],
        },
    },

    {
        唯一标识: '獬豸',
        在界面中的称谓: '獬（xiè）豸（zhì）',
        数据: {
            描述: [
                '',
            ],
        },
    },

    {
        唯一标识: '狴犴',
        在界面中的称谓: '狴（bì）犴（àn）',
        数据: {
            描述: [
                '',
            ],
        },
    },

    {
        唯一标识: '冉遗',
        在界面中的称谓: '冉（rǎn）遗',
        数据: {
            描述: [
                '',
            ],
        },
    },

    {
        唯一标识: '夔牛',
        在界面中的称谓: '夔（kuí）牛',
        数据: {
            描述: [
                '',
            ],
        },
    },

    {
        唯一标识: '山膏',
        在界面中的称谓: '山膏（huān）',
        数据: {
            描述: [
                '',
            ],
        },
    },

    {
        唯一标识: '騊駼',
        在界面中的称谓: '騊（táo）駼（tú）',
        数据: {
            描述: [
                '',
            ],
        },
    },

    {
        唯一标识: '陆吾',
        在界面中的称谓: '陆吾',
        数据: {
            描述: [
                '',
            ],
        },
    },

    {
        唯一标识: '蛩蛩',
        在界面中的称谓: '蛩（qiónɡ）蛩（qiónɡ）',
        数据: {
            描述: [
                '',
            ],
        },
    },

    {
        唯一标识: '乘黄',
        在界面中的称谓: '乘（shèng）黄',
        数据: {
            描述: [
                '',
            ],
        },
    },

    {
        唯一标识: '重明鸟',
        在界面中的称谓: '重明鸟',
        数据: {
            描述: [
                '',
            ],
        },
    },

    {
        唯一标识: '凤凰',
        在界面中的称谓: '凤凰',
        数据: {
            描述: [
                '',
            ],
        },
    },

    {
        唯一标识: '混沌',
        在界面中的称谓: '混沌',
        数据: {
            描述: [
                '',
            ],
        },
    },

    {
        唯一标识: '麒麟',
        在界面中的称谓: '麒麟',
        数据: {
            描述: [
                '',
            ],
        },
    },

    {
        唯一标识: '猰貐',
        在界面中的称谓: '猰（yà）貐（yǔ）',
        数据: {
            描述: [
                '',
            ],
        },
    },

    {
        唯一标识: '横公鱼',
        在界面中的称谓: '横公鱼',
        数据: {
            描述: [
                '',
            ],
        },
    },

    {
        唯一标识: '英招',
        在界面中的称谓: '英招',
        数据: {
            描述: [
                '',
            ],
        },
    },

    {
        唯一标识: '巴蛇',
        在界面中的称谓: '巴蛇',
        数据: {
            描述: [
                '',
            ],
        },
    },

    {
        唯一标识: '应龙',
        在界面中的称谓: '应（yīng）龙',
        数据: {
            描述: [
                '',
            ],
        },
    },

    {
        唯一标识: '烛龙',
        在界面中的称谓: '烛龙',
        数据: {
            描述: [
                '',
            ],
        },
    },

    {
        唯一标识: '辟邪',
        在界面中的称谓: '辟邪',
        数据: {
            描述: [
                '',
            ],
        },
    },

    {
        唯一标识: '天马',
        在界面中的称谓: '天马',
        数据: {
            描述: [
                '',
            ],
        },
    },

    {
        唯一标识: '鱼妇',
        在界面中的称谓: '鱼妇',
        数据: {
            描述: [
                '',
            ],
        },
    },

    {
        唯一标识: '当扈',
        在界面中的称谓: '当（dāng）扈（hù）',
        数据: {
            描述: [
                '',
            ],
        },
    },

    {
        唯一标识: '青鸟',
        在界面中的称谓: '青鸟',
        数据: {
            描述: [
                '',
            ],
        },
    },

    {
        唯一标识: '化蛇',
        在界面中的称谓: '化蛇',
        数据: {
            描述: [
                '',
            ],
        },
    },

    {
        唯一标识: '朱厌',
        在界面中的称谓: '朱厌',
        数据: {
            描述: [
                '',
            ],
        },
    },

    {
        唯一标识: '角端',
        在界面中的称谓: '角端',
        数据: {
            描述: [
                '',
            ],
        },
    },

    {
        唯一标识: '当康',
        在界面中的称谓: '当康',
        数据: {
            描述: [
                '',
            ],
        },
    },

    {
        唯一标识: '赤鱬',
        在界面中的称谓: '赤鱬（rú）',
        数据: {
            描述: [
                '',
            ],
        },
    },

    {
        唯一标识: '兕',
        在界面中的称谓: '兕（sì）',
        数据: {
            描述: [
                '',
            ],
        },
    },
]
